Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/special_criminal_court.html.txt.tmx
Source language: en
Languages: ga

source: Special Criminal Courts relate to criminal trials only
ga: Baineann Cúirteanna Coiriúil Speisialta le trialacha coiriúil amháin

source: They are established where the ordinary courts are inadequate to secure the effective administration of justice and the preservation of public peace and order
ga: Bunaítear iad áit nach bhfuil na gnáthchúirteanna oiriúnach chun riaradh éifeachtach dlí agus cirt agus cosaint síochána poiblí a chinntiú

source: The present Special Criminal Court was established in 1972 and comprises three judges of the ordinary courts - usually one High Court judge, one Circuit Court Judge and District Court Judge
ga: Is i 1972 a bunaíodh an Chúirt Choiriúil Speisialta atá ann faoi láthair agus tá sí déanta suas de trí bhreitheamh ó na gnáth chúirteanna - go hiondúil breitheamh ón Ard Chúirt, breitheamh ón gCúirt Chuarda agus breitheamh ón gCúirt Dúiche

source: There is no jury in the Special Criminal Court
ga: Níl aon ghiúré sa gCúirt Choiriúil Speisialta

source: The Special Criminal Court has no civil jurisdiction
ga: Níl aon dhlínse sibhialta ag an gCúirt Choiriúil Speisialta

source: Criminal cases are transferred from the ordinary criminal courts to the Special Criminal Court if:
ga: Aistrítear cásanna ó na gnáthchúirteanna coiriúil go dtí an Chúirt Choiriúil Speisialta:

source: • The offence in question is a scheduled offence
ga: • Nuair is coir sceidealta atá sa gcoir atá i gceist

source: Cases involving a scheduled offence generally involve subversive crime and are automatically transferred to the Special Criminal Court
ga: I gcásanna ina bhfuil coir sceidealta is iondúil go mbíonn coir treascrach i gceist agus téann siad seo i gcónaí chuig an gCúirt Choiriúil Speisialta

source: The current list of scheduled offences includes:
ga: Ar an liosta coireanna sceidealta tá:

source: -offences under Part 7 of the Criminal Justice Act 2006 (excluding conspiracy)
ga: - cionta faoin Chuid 7, Acht um Cheartas Coiriúil 2006

source: - offences under the Explosive Substances Act 1883
ga: - cionta faoin Acht um Substaintí Pléascacha 1883

source: - offences under the Firearms Acts 1925 to 2006
ga: - cionta faoin Acht Arm tine 1925 go 1990

source: - offences under the Offences against the State Acts 1939 to 1998
ga: - cionta faoin Acht um Choireanna i gCoinne an Stáit 1939 go 1998

source: • The offence in question is not a "scheduled offence" but the Director of Public Prosecutions issues a certificate stating that in his/her opinion, the ordinary courts are inadequate to secure the administration of justice and the preservation of public peace and order
ga: • Nuair nach "coir sceidealta" atá sa choir atá i gceist ach go n-eisíonn an Stiúrthóir Ionchúiseamh Poiblí teastas ag dearbhú, ina thuairim, nach bhfuil na gnáthchúirteanna feiliúnach chun riaradh dlí agus cirt agus cosaint síochána poiblí a chinntiú

source: Once such a certificate is issued, the case must be transferred from the ordinary court to the Special Criminal Court
ga: Nuair a eisíotar teastas den chinéal, caithtear an cás a aistriú ón gnáthchúirt go dtí an Cúirt Choiriúil Speisialta
